Scr/Catalogs/ПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ПечатныеФормы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>хрОбработкаПечати</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеГруппировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗамещаетОсновнуюФорму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПроцедурыПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФильтрЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаФильтра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>222</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнФильтра</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыПоКонтрагентам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>хрОбработкаПечати</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>333</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДокументовДЛяПечФорм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Scr/Catalogs/ПечатныеФормы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыборФайла(Команда)
	
	
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если Команда.Имя = "ВыборФайлаКА" Тогда
		Если Элементы.ФормыПоКонтрагентам.ТекущаяСтрока=Неопределено Тогда Возврат; КонецеСЛИ;
	КонецесЛИ;
	
	Оо = Новый ОписаниеОповещения("ОО_ОбработкаВыборФайла",ЭтаФорма,Команда.Имя);
	Оо1 = Новый ОписаниеОповещения("ОО_НачалоОбработкаВыборФайла",ЭтаФорма);
	НачатьПомещениеФайлов(Оо,Диалог,Истина,ЭтаФорма.УникальныйИдентификатор,Оо1);
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОО_ОбработкаВыборФайла(ПомещенныеФайлы, ДопПараметры)Экспорт
	Если ТипЗнч(ПомещенныеФайлы) <> Тип("Массив")	Тогда  Возврат; КонецеСЛИ;
	

	
	Для каждого помФайл из ПомещенныеФайлы Цикл
		
		Если  ДопПараметры = "ВыборФайлаКА" Тогда
			текстр = Элементы.ФормыПоКонтрагентам.ТекущиеДанные;
			текстр.АдресХраненияФайла = помФайл.Хранение;
			текстр.ИмяФайлаОбработки =помФайл.Имя;
			текстр.ЛОг = ""+ТекущаяДата()+" - "+ИмяПользователя()+" - "+ИмяКомпьютера();
			
		ИНаче
			АдресХраненияФайла = помФайл.Хранение;
			Объект.ИмяФайлаОбработки =помФайл.Имя;
			Объект.ЛОг = ""+ТекущаяДата()+" - "+ИмяПользователя()+" - "+ИмяКомпьютера();
		КонецеСЛИ;
		
	КонецЦикла;
		
КонецПроцедуры 


&НаКлиенте
Процедура ОО_НачалоОбработкаВыборФайла(ПомещаемыеФайлы,ОтказОтПомещенияВсехФайлов,ДополнительныеПараметры) экспорт
	
	Если ТипЗнч(ПомещаемыеФайлы) <> Тип("Массив")	Тогда Возврат; КонецеСЛИ;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если  СокрлП(АдресХраненияФайла)<>"" Тогда
		ТекущийОбъект.хрОбработкаПечати = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресХраненияФайла));
	КонецЕсли;
	
	Для а=1 по Объект.ФормыПоКонтрагентам.Количество() Цикл
		Стр =Объект.ФормыПоКонтрагентам[а-1];
		Если СокрлП(Стр.АдресХраненияФайла)<>"" Тогда
			ТекущийОбъект.ФормыПоКонтрагентам[а-1].хрОбработкаПечати = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Стр.АдресХраненияФайла));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьАдрес(Рек)
	
	Обк = РеквизитФормыВЗначение("Объект");
	Возврат ПоместитьВоВременноеХранилище(Обк[Рек].Получить());
	
КонецФункции

Функция ПолучитьАдресКА(нс)
	
	Обк = РеквизитФормыВЗначение("Объект");
	ТекСтр = Обк.ФормыПоКонтрагентам.Получить(нс);
	Возврат ПоместитьВоВременноеХранилище(ТекСтр.хрОбработкаПечати.Получить());
	
КонецФункции

&НаКлиенте
Процедура СохранитьФайл(Команда)
	НачатьПолучениеФайлаССервера(ПолучитьАдрес("хрОбработкаПечати"),Объект.ИмяФайлаОбработки);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлКА(Команда)
		Если Элементы.ФормыПоКонтрагентам.ТекущаяСтрока=Неопределено Тогда Возврат; КонецеСЛИ;
	 ТекСтр = Элементы.ФормыПоКонтрагентам.ТекущиеДанные;
	
	НачатьПолучениеФайлаССервера(ПолучитьАдресКА(Элементы.ФормыПоКонтрагентам.ТекущиеДанные.НомерСтроки-1),ТекСтр.ИмяФайлаОбработки);
КонецПроцедуры
